.sample-xml/account-balance-request-response.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <QUERYACCTBAL_IOFS_RES xmlns="http://fcubs.ofss.com/service/FCUBSAccService">
         <FCUBS_HEADER>
            <SOURCE>SMFBPORTAL</SOURCE>
            <UBSCOMP>FCUBS</UBSCOMP>
            <MSGID>6125041000561333</MSGID>
            <CORRELID>null</CORRELID>
            <USERID>SYSTEM</USERID>
            <ENTITY>null</ENTITY>
            <BRANCH>001</BRANCH>
            <MODULEID>ST</MODULEID>
            <SERVICE>FCUBSAccService</SERVICE>
            <OPERATION>QueryAcctBal</OPERATION>
            <DESTINATION>SMFBPORTAL</DESTINATION>
            <FUNCTIONID>STDCUSBL</FUNCTIONID>
            <ACTION>EXECUTEQUERY</ACTION>
            <MSGSTAT>SUCCESS</MSGSTAT>
         </FCUBS_HEADER>
         <FCUBS_BODY>
            <Custbal-Full>
               <CUST_AC_NO>0010172338</CUST_AC_NO>
               <AC_DESC>MOHAMED NOOR ABDI AHMED</AC_DESC>
               <CUSTOMER_NO>007129</CUSTOMER_NO>
               <CCY>KES</CCY>
               <CURRBAL>210666734.55</CURRBAL>
               <AVLBAL>210173355.52</AVLBAL>
               <DORMANT>N</DORMANT>
               <ACSTATNCR>N</ACSTATNCR>
               <NODEBIT>N</NODEBIT>
               <ACSTATFRZN>N</ACSTATFRZN>
               <STATUS>NORMAL STATUS</STATUS>
               <CUST_NAME>MOHAMED NOOR ABDI AHMED</CUST_NAME>
               <BRHCODE>001</BRHCODE>
               <PREV_DAY_BOOK_BAL>183888.22</PREV_DAY_BOOK_BAL>
               <ACY_BLOCKED_AMOUNT1>333263.03</ACY_BLOCKED_AMOUNT1>
               <AVL_TOD>0</AVL_TOD>
               <CUSTOMER_CATEGORY>INDIVIDUAL</CUSTOMER_CATEGORY>
               <ACCLASSDESC>STAFF ACCOUNT</ACCLASSDESC>
               <ACCOUNT_CLASS>STAF</ACCOUNT_CLASS>
               <OPRTNMDE>Single</OPRTNMDE>
               <OWNERSHIP>Single</OWNERSHIP>
               <ACSTATDEPST>Y</ACSTATDEPST>
               <STOP_PAY>N</STOP_PAY>
               <STATCHNGAUTMATIC>Y</STATCHNGAUTMATIC>
               <ACY_OPENING_BAL>183888.22</ACY_OPENING_BAL>
               <ACY_TODAY_TOVER_CR>219497101.57</ACY_TODAY_TOVER_CR>
               <ACY_TODAY_TOVER_DR>9004255.24</ACY_TODAY_TOVER_DR>
               <NSF_BLACKLIST_STATUS>N</NSF_BLACKLIST_STATUS>
               <ACY_CURR_BALANCE>210666734.55</ACY_CURR_BALANCE>
               <ACY_ACCRUED_CR_IC>0</ACY_ACCRUED_CR_IC>
               <ACY_ACCRUED_DR_IC>0</ACY_ACCRUED_DR_IC>
               <DR_INT_DUE>0</DR_INT_DUE>
               <CHARGE_DUE>0</CHARGE_DUE>
               <LAST_INTEREST_DEBIT>0</LAST_INTEREST_DEBIT>
               <LAST_INTEREST_CREDIT>0</LAST_INTEREST_CREDIT>
               <LAST_CR_ACTIVITY>2025-06-07</LAST_CR_ACTIVITY>
               <LAST_DR_ACTIVITY>2025-06-07</LAST_DR_ACTIVITY>
               <CURRENT_BALANCE>210676734.55</CURRENT_BALANCE>
               <ACY_UNCOLLECTED>0</ACY_UNCOLLECTED>
               <BLOCKED1>333263.03</BLOCKED1>
               <ACY_AVL_BAL>210173355.52</ACY_AVL_BAL>
               <ODREQ>N</ODREQ>
               <DIS_TOT_AVL_AMOUNT>210173355.52</DIS_TOT_AVL_AMOUNT>
               <BOOK_BALANCE>210173355.52</BOOK_BALANCE>
               <SWEEP_ELIG_BAL>210666734.55</SWEEP_ELIG_BAL>
               <TOD_LIMIT>0</TOD_LIMIT>
               <AC_OPEN_DATE>2022-12-19</AC_OPEN_DATE>
               <SWP_IN>N</SWP_IN>
               <NET_BAL>210173355.52</NET_BAL>
               <ONSWPELIGBAL>0</ONSWPELIGBAL>
               <DROVD>N</DROVD>
               <CROVD>N</CROVD>
               <Transaction>
                  <VALUE_DT>2025-06-07</VALUE_DT>
                  <TRN_DESC>PRINCIPAL REPAYMENT EMURAABAHA: - REF DISB--000039901868 - CUST.A/C 0010172338 - V.A/C 0010172338</TRN_DESC>
                  <ORIG_BRN>001</ORIG_BRN>
                  <DEBIT>1900</DEBIT>
                  <CREDIT>0</CREDIT>
                  <LCY_AMOUNT>1900</LCY_AMOUNT>
                  <TRN_REF_NO>001EMRP251580453</TRN_REF_NO>
                  <TRN_DT>2025-06-07</TRN_DT>
                  <AC_BRANCH>001</AC_BRANCH>
               </Transaction>
               <Transaction>
                  <VALUE_DT>2025-06-07</VALUE_DT>
                  <TRN_DESC>PRINCIPAL REPAYMENT EMURAABAHA: - REF DISB--000039901868 - CUST.A/C 0010172338 - V.A/C 0010172338</TRN_DESC>
                  <ORIG_BRN>001</ORIG_BRN>
                  <DEBIT>31666.67</DEBIT>
                  <CREDIT>0</CREDIT>
                  <LCY_AMOUNT>31666.67</LCY_AMOUNT>
                  <TRN_REF_NO>001EMRP251580453</TRN_REF_NO>
                  <TRN_DT>2025-06-07</TRN_DT>
                  <AC_BRANCH>001</AC_BRANCH>
               </Transaction>
               <Transaction>
                  <VALUE_DT>2025-06-07</VALUE_DT>
                  <TRN_DESC>DISBURSEMENT : E-MURABAHA BOOKING - REF DISB--000039901868 - CUST.A/C 0010172338 - V.A/C 0010172338</TRN_DESC>
                  <ORIG_BRN>001</ORIG_BRN>
                  <DEBIT>0</DEBIT>
                  <CREDIT>95000</CREDIT>
                  <LCY_AMOUNT>95000</LCY_AMOUNT>
                  <TRN_REF_NO>001EMRB251583220</TRN_REF_NO>
                  <TRN_DT>2025-06-07</TRN_DT>
                  <AC_BRANCH>001</AC_BRANCH>
               </Transaction>
               <Transaction>
                  <VALUE_DT>2025-06-07</VALUE_DT>
                  <TRN_DESC>Move money for testing</TRN_DESC>
                  <ORIG_BRN>001</ORIG_BRN>
                  <DEBIT>1000</DEBIT>
                  <CREDIT>0</CREDIT>
                  <LCY_AMOUNT>1000</LCY_AMOUNT>
                  <TRN_REF_NO>001UTFR251580033</TRN_REF_NO>
                  <TRN_DT>2025-06-07</TRN_DT>
                  <AC_BRANCH>001</AC_BRANCH>
               </Transaction>
               <Transaction>
                  <VALUE_DT>2025-06-07</VALUE_DT>
                  <TRN_DESC>Move money for testing</TRN_DESC>
                  <ORIG_BRN>001</ORIG_BRN>
                  <DEBIT>1000</DEBIT>
                  <CREDIT>0</CREDIT>
                  <LCY_AMOUNT>1000</LCY_AMOUNT>
                  <TRN_REF_NO>001UTFR251580030</TRN_REF_NO>
                  <TRN_DT>2025-06-07</TRN_DT>
                  <AC_BRANCH>001</AC_BRANCH>
               </Transaction>
            </Custbal-Full>
            <FCUBS_WARNING_RESP>
               <WARNING>
                  <WCODE>ST-SAVE-023</WCODE>
                  <WDESC>Record Successfully Retrieved</WDESC>
               </WARNING>
            </FCUBS_WARNING_RESP>
         </FCUBS_BODY>
      </QUERYACCTBAL_IOFS_RES>
   </S:Body>
</S:Envelope>